Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_and_rights/index.html.txt.tmx
Source language: en
Languages: ga

source: Fundamental Rights under the Irish Constitution
ga: Bunchearta faoi Bhunreacht na hÉireann

source: The Irish Constitution recognises and declares that you have certain fundamental personal rights
ga: Deir an Bunreacht go bhfuil bunchearta pearsanta ar leith agat agus tugann sé aitheantas dóibh

source: These are confirmed and protected by the Constitution
ga: Is cearta iad seo a bhaineann leis an gcine daonna, is cearta nádúrtha daonna iad agus dearbhaíonn an Bunreacht iad agus tugann sé cosaint dóibh

source: This document is in: Government in Ireland > Irish Constitution
ga: This document is in: Rialtas in Éirinn > Bunreacht na hÉireann

source: This document describes how laws are made by the Oireachtas (the Irish parliament)
ga: Déantar cuir síos anseo ar conas a dhéanann an tOireachtas dlíthe

source: This document is in: Government in Ireland > National government > Houses of the Oireachtas
ga: This document is in: Rialtas in Éirinn > Rialtas Náisiúnta na hÉireann > Tithe an Oireachtais

source: The fundamental laws of the European Union are set out in the Treaties
ga: Tá bundlíthe nó rialacha Aontas na hEorpa (AE) leagtha síos i gconarthaí

source: Find out how the institutions of the EU also have the power to make new laws
ga: Faigh amach tuilleadh faoin chumhacht reachtaíochta nua ag institiúidí an AE

source: This document is in: Government in Ireland > European government > EU Law
ga: This document is in: Rialtas in Éirinn > Rialtas Eorpach > Dlí an AE

source: Appealing rights under EU law
ga: Cearta achomhairc faoi dlí na hEorpa

source: An outline of how your rights are safeguarded under EU law and the various European institutions involved
ga: Cur síos ar an mbealach le cearta an duine a chosaint faoi dlí an AE agus na hinstitiúidí Eorpacha eagsúla a bhaineann leis

source: Access to Garda records
ga: Rochtain ar thaifid na nGardaí

source: Under data protection legislation you have the right to access personal information which the Gardaí hold on you, except in certain circumstances
ga: Faoi reachtaíocht cosanta sonraí tá an ceart agat rochtain a fháil ar shonraí pearsanta atá á gcoinneáil ag na Gardaí fút, ach amháin i gcúinsí áirithe

source: Find out how to access your information
ga: Faigh amach conas rochtain a fháil ar do chuid faisnéise

source: Irish Human Rights and Equality Commission
ga: Coimisiún na hÉireann um Chearta an Duine agus Comhionannas

source: The Commission promotes and protects human rights and equality
ga: Déanann an Coimisiún cearta an duine agus comhionannas a chur chun cinn agus a chosaint

source: In some cases, it can assist you to further human rights issues by assisting with legal proceedings
ga: I roinnt cásanna, féadfaidh an Coimisiún cabhrú leat chun saincheisteanna chearta an duine a chur chun cinn nó trí chabhrú leat le himeachtaí dlí

source: Judicial review of public decisions
ga: Athbhreithniú Breithiúnach ar Chinntí Poiblí

source: Public decisions may be judicially reviewed by the High Court to determine whether they are illegal
ga: Is féidir leis an Ard-Chúirt athbhreithniú breithiúnach a dhéanamh ar chinntí poiblí le dearbhú an bhfuil siad neamhdhleathach

source: Find out how to initiate judicial review proceedings
ga: Faigh amach conas imeachtaí athbhreithnithe bhreithiúnaigh a thionscnamh

source: This document is in: Government in Ireland > National government > Standards and accountability
ga: This document is in: Rialtas in Éirinn > Rialtas Náisiúnta na hÉireann > Caighdeáin agus Cuntasacht

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"

source: Alcohol and the law
ga: Alcól agus an dlí
